Autodesk.Revit.DB.Structure.RebarReinforcementData.Create(Autodesk.Revit.DB.ElementId,System.Int32)
Creates a new instance of RebarReinforcementData, or null if the operation fails.
rebarId:
the Id of the rebar
iEnd:
The end of rebar where the coupler stays. This should be 0 or 1
Returns:
Creates a new instance of RebarReinforcementData
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.RebarReinforcementData.RebarId
The id of the Rebar
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017